; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v1 - type_3 ?v2 - type_1)
 	      (pred_1 ?v4 - object ?v2 - type_1)
	      (pred_3 ?v1 - type_3 ?v5 - type_2)
	      (pred_4 ?v1 - type_3 ?v4 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v1 - type_3 ?v8 ?v6 - type_1)
       :precondition (and  (pred_2 ?v1 ?v8))
       :effect (and  (pred_2 ?v1 ?v6)
		     (not (pred_2 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_3 ?v3 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v7) (pred_2 ?v1 ?v7) (pred_3 ?v1 ?v5))
       :effect (and (pred_4 ?v1 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v7)) 
		    (not (pred_3 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_3 ?v3 - object ?v7 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v1 ?v3 ?v5) (pred_2 ?v1 ?v7))
       :effect (and (pred_1 ?v3 ?v7)
		    (pred_3 ?v1 ?v5)
		    (not (pred_4 ?v1 ?v3 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_02 - type_3
obj_01 obj_05 obj_06 obj_08 - type_2
obj_09 obj_04 obj_12 - type_1
obj_11 obj_10 obj_03 - object)
(:init
(pred_2 obj_07 obj_09)
(pred_3 obj_07 obj_01)
(pred_3 obj_07 obj_05)
(pred_2 obj_02 obj_09)
(pred_3 obj_02 obj_06)
(pred_3 obj_02 obj_08)
(pred_1 obj_11 obj_09)
(pred_1 obj_10 obj_09)
(pred_1 obj_03 obj_12)
)
(:goal
(and
(pred_1 obj_11 obj_04)
(pred_1 obj_10 obj_12)
(pred_1 obj_03 obj_12)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_12)))
)
)

; plan
1. (op_2 obj_07 obj_11 obj_09 obj_05)
   deleted: (pred_1 obj_11 obj_09) (pred_3 obj_07 obj_05)
   added: (pred_4 obj_07 obj_11 obj_05)
   goals met: 1 of 3
2. (op_2 obj_02 obj_10 obj_09 obj_08)
   deleted: (pred_1 obj_10 obj_09) (pred_3 obj_02 obj_08)
   added: (pred_4 obj_02 obj_10 obj_08)
   goals met: 1 of 3
3. (op_1 obj_02 obj_09 obj_12)
   deleted: (pred_2 obj_02 obj_09)
   added: (pred_2 obj_02 obj_12)
   goals met: 1 of 3
4. (op_1 obj_07 obj_09 obj_04)
   deleted: (pred_2 obj_07 obj_09)
   added: (pred_2 obj_07 obj_04)
   goals met: 1 of 3
5. (op_3 obj_02 obj_10 obj_12 obj_08)
   deleted: (pred_4 obj_02 obj_10 obj_08)
   added: (pred_1 obj_10 obj_12) (pred_3 obj_02 obj_08)
   goals met: 2 of 3
6. (op_3 obj_07 obj_11 obj_04 obj_05)
   deleted: (pred_4 obj_07 obj_11 obj_05)
   added: (pred_1 obj_11 obj_04) (pred_3 obj_07 obj_05)
   goals met: 3 of 3
